app/controllers/cadastros_controller.rb

SELECT "cadastros".* FROM "cadastros"
---
  def index
    @cadastros = Cadastro.all

INSERT INTO "cadastros" ("name", "data", "hour", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["data", "2018-09-14"], ["hour", "16:59:00"], ["value", ""], ["created_at", "2018-09-14 16:59:09.163979"], ["updated_at", "2018-09-14 16:59:09.163979"]]
---
  def create
    @cadastro = Cadastro.new(cadastro_params)

    respond_to do |format|
      if @cadastro.save

UPDATE "cadastros" SET "descricao" = $1, "updated_at" = $2 WHERE "cadastros"."id" = $3  [["descricao", "teste"], ["updated_at", "2018-09-17 13:07:12.957303"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @cadastro.update(cadastro_params)

DELETE FROM "cadastros" WHERE "cadastros"."id" = $1  [["id", 3]]
---
  def destroy
    @cadastro.destroy

SELECT  "cadastros".* FROM "cadastros" WHERE "cadastros"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_cadastro
      @cadastro = Cadastro.find(params[:id])